{
  "movies": [
    {
      "id": 1701884197071,
      "title": "Cars",
      "rating": "7.2",
      "movieSummary": "On the way to the biggest race of his life, a hotshot rookie race car gets stranded in a rundown town and learns that winning isn't everything in life.",
      "genre": "Animation, Adventure, Comedy"
    },
    {
      "id": 1701884604900,
      "title": "Cars 3",
      "rating": "6.7",
      "movieSummary": "Lightning McQueen sets out to prove to a new generation of racers that he's still the best race car in the world.",
      "genre": "Animation, Adventure, Comedy"
    },
    {
      "id": 1701884607411,
      "title": "Shrek",
      "rating": "7.9",
      "movieSummary": "A mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back.",
      "genre": "Animation, Adventure, Comedy"
    },
    {
      "id": 1701884610386,
      "title": "Shrek 2",
      "rating": "7.3",
      "movieSummary": "Shrek and Fiona travel to the Kingdom of Far Far Away, where Fiona's parents are King and Queen, to celebrate their marriage. When they arrive, they find they are not as welcome as they thought they would be.",
      "genre": "Animation, Adventure, Comedy"
    },
    {
      "id": 1701884616166,
      "title": "Shrek the Third",
      "rating": "6.1",
      "movieSummary": "Reluctantly designated as the heir to the land of Far, Far Away, Shrek hatches a plan to install the rebellious Artie as the new king while Princess Fiona tries to fend off a coup d'état by the jilted Prince Charming.",
      "genre": "Animation, Adventure, Comedy"
    },
    {
      "id": 1701890321988,
      "title": "Die Hard",
      "rating": "8.2",
      "movieSummary": "A New York City police officer tries to save his estranged wife and several others taken hostage by terrorists during a Christmas party at the Nakatomi Plaza in Los Angeles.",
      "genre": "Action, Thriller"
    },
    {
      "id": 1701891187413,
      "title": "300",
      "rating": "7.6",
      "movieSummary": "King Leonidas of Sparta and a force of 300 men fight the Persians at Thermopylae in 480 B.C.",
      "genre": "Action, Drama"
    },
    {
      "id": 1701962487896,
      "title": "Star Wars: Episode IV - A New Hope",
      "rating": "8.6",
      "movieSummary": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth ...",
      "genre": "Action, Adventure, Fantasy"
    },
    {
      "id": 1701962559611,
      "title": "Star Wars: Episode V - The Empire Strikes Back",
      "rating": "8.7",
      "movieSummary": "After the Rebels are overpowered by the Empire, Luke Skywalker begins his Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.",
      "genre": "Action, Adventure, Fantasy"
    },
    {
      "id": 1701962588509,
      "title": "Star Wars: Episode VI - Return of the Jedi",
      "rating": "8.3",
      "movieSummary": "After rescuing Han Solo from Jabba the Hutt, the Rebels attempt to destroy the second Death Star, while Luke struggles to help Darth Vader back from the dark side.",
      "genre": "Action, Adventure, Fantasy"
    },
    {
      "id": 1701962611565,
      "title": "Star Wars: Episode I - The Phantom Menace",
      "rating": "6.5",
      "movieSummary": "Two Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long dormant Sith resurface to claim their original glory.",
      "genre": "Action, Adventure, Fantasy"
    },
    {
      "id": 1701962623974,
      "title": "Star Wars: Episode II - Attack of the Clones",
      "rating": "6.6",
      "movieSummary": "Ten years after initially meeting, Anakin Skywalker shares a forbidden romance with Padmé Amidala, while Obi-Wan Kenobi discovers a secret clone army crafted for the Jedi.",
      "genre": "Action, Adventure, Fantasy"
    },
    {
      "id": 1701962648925,
      "title": "Star Wars: Episode III - Revenge of the Sith",
      "rating": "7.6",
      "movieSummary": "Three years into the Clone Wars, Obi-Wan pursues a new threat, while Anakin is lured by Chancellor Palpatine into a sinister plot to rule the galaxy.",
      "genre": "Action, Adventure, Fantasy"
    }
  ]
}