{
  "movies": [
    {
      "id": 1,
      "title": "Star Wars: Episode IV - A New Hope",
      "rating": "8.6",
      "genre": "Science Fiction, Action, Adventure, Fantasy",
      "movieSummary": "Luke Skywalker, a young farm boy on the desert planet Tatooine, embarks on a journey to rescue Princess Leia from the evil Darth Vader and help the Rebel Alliance in their fight against the Galactic Empire.",
      "runtime": "121 min"
    },
    {
      "id": 2,
      "title": "Star Wars: Episode V - The Empire Strikes Back",
      "movieSummary": "After the Rebels suffer a major defeat, Luke Skywalker goes to the planet Dagobah to train with Jedi Master Yoda, while his friends Han Solo and Princess Leia face off against the Empire's forces.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "8.7",
      "runtime": "124 min"
    },
    {
      "id": 3,
      "title": "Star Wars: Episode VI - Return of the Jedi",
      "movieSummary": "Luke Skywalker confronts Darth Vader and the Emperor, while the Rebel Alliance launches a final assault on the Death Star, leading to the ultimate showdown between good and evil.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "8.3",
      "runtime": "131 min"
    },
    {
      "id": 4,
      "title": "Star Wars: Episode I - The Phantom Menace",
      "movieSummary": "Two Jedi Knights, Qui-Gon Jinn and Obi-Wan Kenobi, discover a young slave named Anakin Skywalker who may be the Chosen One destined to bring balance to the Force while facing the emergence of the Sith.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "6.5",
      "runtime": "136 min"
    },
    {
      "id": 5,
      "title": "Star Wars: Episode II - Attack of the Clones",
      "movieSummary": "Anakin Skywalker becomes a Jedi apprentice while the Galactic Republic faces growing turmoil, leading to the Clone Wars, a conflict that will shape the destiny of the galaxy.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "6.6",
      "runtime": "142 min"
    },
    {
      "id": 6,
      "title": "Star Wars: Episode III - Revenge of the Sith",
      "movieSummary": "Anakin Skywalker succumbs to the dark side and becomes Darth Vader, while the Republic transforms into the Empire, ultimately leading to the rise of the Rebel Alliance.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "7.5",
      "runtime": "140 min"
    },
    {
      "id": 7,
      "title": "Star Wars: Episode VII - The Force Awakens",
      "movieSummary": "A new generation of heroes and villains emerges as the Resistance and the First Order clash in a galaxy still haunted by the legacy of the Sith and the Jedi.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "7.8",
      "runtime": "138 min"
    },
    {
      "id": 8,
      "title": "Star Wars: Episode VIII - The Last Jedi",
      "movieSummary": "Rey seeks training from Luke Skywalker, but the Resistance faces dire circumstances as the First Order closes in, testing the heroes' resolve and the power of the Force.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "7.0",
      "runtime": "151 min"
    },
    {
      "id": 9,
      "title": "Star Wars: Episode IX - The Rise of Skywalker",
      "movieSummary": "The Resistance faces the return of Emperor Palpatine, and Rey, along with her allies, must confront the ultimate evil while seeking to restore hope to the galaxy.",
      "genre": [
        "Science Fiction, Action, Adventure, Fantasy"
      ],
      "rating": "6.5",
      "runtime": "142 min"
    },
    {
      "id": 1701970961912,
      "title": "Shrek",
      "rating": "7.9",
      "movieSummary": "A mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back.",
      "genre": "Animation, Adventure, Comedy",
      "runtime": "90 min"
    },
    {
      "id": 1701972430271,
      "title": "Shrek 2",
      "rating": "7.3",
      "movieSummary": "Shrek and Fiona travel to the Kingdom of Far Far Away, where Fiona's parents are King and Queen, to celebrate their marriage. When they arrive, they find they are not as welcome as they thought they would be.",
      "genre": "Animation, Adventure, Comedy",
      "runtime": "93 min"
    },
    {
      "id": 1701981000624,
      "title": "300",
      "rating": "7.6",
      "movieSummary": "King Leonidas of Sparta and a force of 300 men fight the Persians at Thermopylae in 480 B.C.",
      "genre": "Action, Drama",
      "runtime": "117 min"
    }
  ]
}